Repository: digiaonline/oulun-energia-mobile
Catalog: lib/l10n/app_*.arb
Languages: fi

source: Electric
fi: Sähkö

source: District heating
fi: Kaukolämpö

source: Cancel
fi: Peruuta

source: Save
fi: Tallenna

source: Send
fi: Lähetä

source: First name
fi: Etunimi

source: Last name
fi: Sukunimi

source: Phone number
fi: Puhelinnumero

# phoneNumberError
source: Wrong phone number format
fi: Puhelinnumeron muoto on virheellinen

source: Email
fi: Sähköpostiosoite

# emailError
source: Wrong email format
fi: Sähköpostiosoitteen muoto on virheellinen

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Title
fi: Aihe

# titleError
source: Title is required
fi: Aihe on pakollinen tieto

source: Message
fi: Viesti

source: Message title
fi: Viestin aihe

# messageError
source: Message is required
fi: Viesti on pakollinen tieto

# sendMessage
source: Send a message
fi: Lähetä viesti

# writeMessage
source: Write a message
fi: Kirjoita viesti

# contactYou
source: Do you want us to contact you?
fi: Haluatko, että otamme sinuun yhteyttä?

source: Contact method
fi: Yhteydenottotapa

source: By phone
fi: Puhelimitse

source: By email
fi: Sähköpostitse

# usageViewAt
source: at
fi: klo.

# usageViewDate
source: Date
fi: Pvm.

# usageViewFetchingData
source: Fetching usage info
fi: Haetaan kulutustietoja

# usageViewSettings
source: Settings
fi: Asetukset

# usageViewUsageInfo
source: Usage info
fi: Kulutustiedot

# usageViewUsageInfoSubText
source: Usage info on an hourly, daily, monthly and yearly level
fi: Kulutustiedot tunti, päivä- kk- ja vuositasolla

# usageViewUsageNoInfo
source: No usage info available
fi: Kulutustietoja ei ole saatavilla

# usageViewUsageErrorInfo
source: There's is a temporary error in fetching the usage info
fi: Kulutustietojen hakemisessa on tilapäinen häiriö

# usageViewMyConsumption
source: My Energy Consumption
fi: Oma Energiankulutus

# usageViewHistory
source: History
fi: Historia

# usageViewHour
source: Hour
fi: Tunti

# usageViewDay
source: Day
fi: Päivä

# usageViewMonth
source: Month
fi: Kuukausi

# usageViewYear
source: Year
fi: Vuosi

# usageViewHome
source: Home
fi: Etusivu

# usageViewMyUsage
source: My usage
fi: Oma kulutus

# usageViewUsage
source: Usage
fi: Kulutus

# usageViewUsagePlace
source: Usage place
fi: Käyttöpaikka

# usageViewUsageType
source: Type
fi: Tyyppi

# usageViewUsageChartInfo
source: Chart info
fi: Kaavion tiedot

# usageViewUsageTemperature
source: Temperature
fi: Lämpötila

# usageViewUsageTemperatureSubText
source: Shows the temperature degrees in Celcius
fi: Näytetään lämpötila Celcius-asteina

# usageViewInterruptions
source: Interruptions
fi: Keskeytykset

# homeViewUsageInfo
source: My Consumption
fi: Omat Kulutustiedot

# homeViewInterruptions
source: Interruption reports
fi: Keskeytys- tiedotteet

# homeViewErrorReporting
source: Error reporting
fi: Vikapäivystys

# homeViewHelp
source: Instructions
fi: Ohjeet

# homeViewMessageSumUp
source: {count, plural, =0{Ei tiedotteita} =1{1 Viesti} many{{count} Viestiä} other{Lukkosymbolilla merkityt osiot näet kirjautumalla palveluun}}
fi: {count, plural, =0{Ei tiedotteita} =1{Yksi uusi viesti} many{{count} Viestiä} other{Lukkosymbolilla merkityt osiot näet kirjautumalla palveluun}}

# homeViewOrderNewsletter
source: Subscribe to the newsletter
fi: Tilaa uutiskirje

# loginViewUsername
source: Username
fi: Käyttäjätunnus

# loginViewPassword
source: Password
fi: Salasana

# registerPageTitle
source: Register
fi: Rekisteröidy

# forgotPasswordPageTitle
source: Retrieve password
fi: Palauta salasanasi

# interruptionsViewTitle
source: Interruptions
fi: Keskeytykset

# interruptionsViewMap
source: Interruptions map
fi: Keskeytyskartta

# interruptionsViewFault
source: Make a fault notice
fi: Ilmoita viasta

# interruptionsViewFaultTitle
source: Faultservice 24 h
fi: Vikapäivystys 24 h

# interruptionsViewFaultElectric
source: Distribution of electricity
fi: Sähkönjakelu

# interruptionsViewFaultHeat
source: District heating
fi: Lämmönjakelu

# interruptionsViewNotice
source: Notice
fi: Tiedote

# interruptionsViewNotices
source: Interruption notices
fi: Keskeytystiedotteet

# interruptionsViewNoticesTitle
source: Mainteinance and interruption notices
fi: Huolto- ja Keskeytystiedotteet

# interruptionsViewNoticesFetchData
source: Fetching notices
fi: Haetaan tiedotteita

# interruptionsViewNoticesFetchNoData
source: No notices found
fi: Tiedotteita ei löytynyt

# interruptionsViewNoticesFetchError
source: There is a temporary error in fetching the notices
fi: Tiedotteiden hakemisessa on tilapäinen häiriö

# navigationDrawerLogin
source: Login
fi: Kirjaudu

# loginViewRememberSignIn
source: Remember me
fi: Muista minut

# popupMenuItemUserInfo
source: Own info
fi: Omat tiedot

# popupMenuItemLogout
source: Logout
fi: Kirjaudu ulos

# popupMenuItemLogin
source: Login
fi: Kirjaudu sisään

# newsletterViewTitle
source: Subscribe to our newsletter!
fi: Tilaa uutiskirjeemme!

# newsletterViewText
source: Subscribe to our electronic newsletter and stay up-to-date on Oulu Energia's news! You will receive information about new products, services and news directly to your email.
fi: Tilaa sähköinen uutiskirjeemme ja pysyt ajan tasalla Oulun Energian kuulumisista! Saat tiedon uusista tuotteista, palveluista ja uutisista suoraan sähköpostiisi.

# newsletterViewDistrictHeatingNews
source: Heating services and current news
fi: Lämpöpalvelut ja ajankohtaiset uutiset

# newsletterViewElectricityNews
source: Electricity network services and current news
fi: Sähköverkkopalvelut ja ajankohtaiset uutiset

# newsletterViewRecyclingNews
source: Recycling economy (newsletter of our subsidiary Suklo Oy)
fi: Kiertotalous (tytäryhtiömme Syklo Oy:n uutiskirje)

# newsletterViewAcceptTermsPrefix
source: I agree to the processing of my personal data in accordance with Oulu Energia's
fi: Hyväksyn henkilötietojeni käsittelyn Oulun Energian

# newsletterViewAcceptTerms
source: privacy statement.
fi: tietosuojaselosteen

# newsletterViewCancellation
source: If you want to cancel your consent to email newsletters, you can do so from the cancellation link at the end of the newsletter.
fi: Jos haluat peruuttaa suostumuksesi sähköpostiuutiskirjeisiin, voit tehdä sen uutiskirjeen lopusta löytyvästä peruutuslinkistä.

source: Contact us
fi: Ota yhteyttä

# contactUsCustomerService
source: Customer service
fi: Asiakaspalvelu

# contactUsCustomerServiceInfo
source: Oulu Energia's customer service will help you with all questions regarding electricity and heat and their billing.
fi: Oulun Energian asiakaspalvelu auttaa sinua kaikissa sähköä ja lämpöä ja niiden laskutusta koskevissa kysymyksissä.

# contactUsPhoneServiceInfo
source: Telephone service: Mon-Thurs 8am-4pm and Fri 9am-4pm
fi: Puhelinpalvelu: ma-to klo 8-16 ja pe klo 9-16

# contactUsElectricAdvice
source: Technical advice on electricity
fi: Sähkön tekninen neuvonta

# contactUsPaymentAdvice
source: Payment advice
fi: Maksuneuvonta

# contactUsPaymentAdviceInfo
source: Questions related to payment period, invoice payment and collection:
fi: Maksuaikaan, laskun maksamiseen ja perintään liittyvät kysymykset:

# contactUsRopoCapital
source: Ropo Capital's online service
fi: Ropo Capitalin online-palvelu

# contactUsRopoCapitalServiceInfo
source: Mon-Fri from 8 am to 8 pm and Sat from 10 am to 3 pm
fi: ma-pe klo 8-20 ja la klo 10-15

# contactUsMapService
source: Map service
fi: Karttapalvelu

# contactUsContactInformation
source: Contact information
fi: Yhteystiedot

# contactUsCableAndHeatmaps
source: Cable and remote heat maps
fi: Kaapeli- ja kaukolämpökartat

# contactUsNonUrgent
source: Non-urgent matters
fi: Kiireettömät asiat

# contactUsNonUrgentInfo
source: For non-urgent matters, you can send a message.
fi: Kiireettömissä asioissa voit lähettää viestin.
